// src/pages/PublicOffer.jsx
import React from "react";
import Footer from "../components/Footer";

const PublicOffer = () => {
  return (
    <>
      <div style={styles.container}>
        {/* <h1 style={styles.title}>
          Публичная оферта и политика проведения платежей
        </h1> */}

        {/* Блок: Политика проведения платежей */}
        <section style={styles.section}>
          <h2>Политика проведения платежей. Оплата банковской картой онлайн</h2>

          <p>
            Наш сайт подключен к интернет-эквайрингу, и Вы можете оплатить заказ
            банковской картой Visa или Mastercard прямо на сайте. После
            подтверждения выбранного заказа откроется защищенное окно с
            платежной страницей платёжного сервиса Robokassa, где Вам необходимо
            ввести данные Вашей банковской карты и адрес электронной почты для
            квитанции или фискального чека. Мы используем протокол 3D Secure для
            подтверждения оплаты. Если Ваш Банк поддерживает данный протокол, Вы
            будете перенаправлены на сервер банка для дополнительной
            идентификации c помощью SMS кода. Информацию о правилах и методах
            дополнительной идентификации уточняйте в Банке, выдавшем Вам
            банковскую карту.
          </p>

          <p>
            В поля на платежной странице требуется ввести номер карты, адрес
            электронной почты, срок действия карты, трёхзначный код безопасности
            (CVV2 для VISA или CVC2 для MasterCard). Все необходимые данные
            отображены на поверхности банковской карты. CVV2/ CVC2 — это
            трёхзначный код безопасности, находящийся на оборотной стороне
            карты. Далее в том же окне откроется страница Вашего банка-эмитента
            для ввода 3-D Secure кода. В случае, если у вас не настроен
            статичный 3-D Secure, он будет отправлен на ваш номер телефона
            посредством SMS. Если 3-D Secure код к Вам не пришел, то следует
            обратится в ваш банк-эмитент. 3-D Secure — это самая современная
            технология обеспечения безопасности платежей по картам в сети
            интернет. Позволяет однозначно идентифицировать подлинность
            держателя карты, осуществляющего операцию, и максимально снизить
            риск мошеннических операций по карте.
          </p>

          <h3>Случаи отказа в совершении платежа</h3>
          <p>
            В случае, если ваш платёж не прошёл или операция была отменена,
            проверьте:
          </p>
          <ul>
            <li>
              правильно ли были введены реквизиты? Обратите внимание на срок
              действия вашей карты и номер;
            </li>
            <li>
              достаточно ли средств на вашей карте? Подробнее о наличии средств
              на платежной карте Вы можете узнать, обратившись в банк,
              выпустивший банковскую карту;
            </li>
            <li>
              открыта ли возможность проведения оплат в интернете? Подробнее о
              возможностях вашей карты карты Вы можете узнать, обратившись в
              банк-эмитент;
            </li>
            <li>
              хватает ли вам ежедневного лимита на платежи в интернете?
              Подробнее о лимитах вашей карты карты Вы можете узнать,
              обратившись в банк-эмитент.
            </li>
          </ul>

          <p>
            По вопросам непрошедшей оплаты, пожалуйста обратитесь в службу
            поддержки банка-эмитента, выпустившего вашу банковскую карту, или в
            службу поддержки сайта, на котором была произведена оплата.
          </p>

          <h3>Гарантии безопасности</h3>
          <p>
            Платёжный сервис Robokassa защищает и обрабатывает данные Вашей
            банковской карты по стандарту безопасности PCI DSS. Передача
            информации в платежный шлюз происходит с применением технологии
            шифрования SSL. Дальнейшая передача информации происходит по
            закрытым банковским сетям, имеющим наивысший уровень надежности.
            Robokassa не передает данные Вашей карты интернет магазину или
            третьим лицам. Для дополнительной аутентификации держателя карты
            используется протокол 3D Secure. В случае, если у Вас есть вопросы
            по совершенному платежу, Вы можете обратиться в службу поддержки
            клиентов по электронной почте{" "}
            <a href="mailto:support@robokassa.kz">support@robokassa.kz</a>
          </p>

          <h3>Безопасность онлайн-платежей</h3>
          <p>
            Предоставляемая Вами персональная информация (e-mail, номер
            банковской карты) является конфиденциальной и не подлежит
            разглашению. Данные Вашей банковской карты передаются только в
            зашифрованном виде и не сохраняются на нашем сервере.
          </p>

          <p>
            Безопасность обработки Интернет-платежей гарантирует платёжный
            сервис Robokassa. Все операции с платежными картами происходят в
            соответствии с требованиями VISA International, MasterCard Worldwide
            и других платежных систем. При передаче информации используется
            специальные технологии безопасности карточных онлайн-платежей,
            обработка данных ведется на безопасном высокотехнологичном сервере
            платёжного сервиса.
          </p>

          <p>Оплата платежными картами безопасна, потому что:</p>
          <ul>
            <li>
              Система авторизации гарантирует покупателю, что платежные
              реквизиты его платежной карты (номер, срок действия, CVV2/CVC2) не
              попадут в руки мошенников, так как эти данные не хранятся на
              сервере в зашифрованном виде и не могут быть похищены.
            </li>
            <li>
              Покупатель вводит свои платежные данные непосредственно в системе
              авторизации Robokassa, а не на сайте интернет-магазина,
              следовательно, платежные реквизиты карточки покупателя не будут
              доступны третьим лицам.
            </li>
          </ul>
        </section>

        {/* Блок: Публичная оферта */}
        <section style={styles.section}>
          <h2>Публичная оферта (о продаже товаров дистанционным способом)</h2>

          <h3>Термины и определения</h3>
          <p>
            В настоящей оферте, если из контекста не следует иное,
            нижеприведенные термины имеют следующие значения и являются её
            составной неотъемлемой частью:
          </p>

          <p>
            <strong>«Продавец», «Оператор»</strong> - юридическое лицо, ИП "
            ДЖАПАРОВА М.М_", БИН/ИИН_820708450240, созданное в соответствии с
            законодательством Республики Казахстан и осуществляющее
            предпринимательскую деятельность по продаже Товаров, в том числе
            дистанционным способом.
          </p>
          <p>
            <strong>«Покупатель», «Пользователь»</strong> - любое физическое
            лицо, принявшее (акцептировавшее) настоящую оферту на нижеуказанных
            условиях и предоставивший Продавцу свои персональные данные
            посредством регистрации на Сайте, которые могут быть использованы
            Продавцом для оформления Заказа Покупателя.
          </p>
          <p>
            <strong>«Сайт»</strong> - официальная веб-страница Продавца на сайте
            _furshetfood.kz__ «Интернет-магазин» - официальный интернет-магазин
            Продавца по продаже Товаров, размещенных на Сайте.
          </p>
          <p>
            <strong>«Интернет-магазин»</strong> - официальный интернет-магазин
            Продавца по продаже Товаров, размещенных на Сайте.
          </p>
          <p>
            <strong>«Товары»</strong> - перечень продукции Продавца,
            представленный на Сайте.
          </p>
          <p>
            <strong>«Заказ»</strong> - оформленный Покупателем в
            Интернет-магазине запрос на покупку и доставку Товаров, выбранных
            Покупателем в Интернет-магазине, и предоставленный Продавцу
            посредством сети Интернет (электронная форма, размещенная на Сайте)
            или оформленный Покупателем по телефону.
          </p>
          <p>
            <strong>«Курьерская служба»</strong> - лица, оказывающие в интересах
            Продавца услуги по доставке заказанных Покупателем Товаров.
          </p>

          <h3>1. Общие положения</h3>
          <p>
            1.1. В соответствии со статьей 395 Гражданского Кодекса Республики
            Казахстан (далее по тексту настоящей оферты – «ГК РК») данный
            документ является публичной офертой, адресованной физическим лицам,
            и в случае принятия изложенных ниже условий, физическое лицо
            обязуется произвести оплату Товара на условиях, изложенных в
            настоящей оферте, момент окончательного подтверждения Заказа
            Покупателем является акцептом оферты Продавца, что является
            равносильным заключению Договора розничной купли-продажи (далее по
            тексту настоящей оферты – «Договор») Товара на условиях,
            установленных в настоящей оферте и на Сайте.
          </p>
          <p>
            1.2. Продавец и Покупатель гарантируют, что обладают необходимой
            право- и дееспособностью, а также всеми правами и полномочиями,
            необходимыми и достаточными для заключения и исполнения Договора
            розничной купли-продажи Товара.
          </p>
          <p>
            1.3. Заказывая Товары через Интернет-магазин, Покупатель
            безоговорочно принимает условия настоящей оферты. Оформленный
            Покупателем на сайте Заказ Товара является подтверждением
            заключенной между Продавцом и Покупателем Договора.
          </p>
          <p>
            1.4. К отношениям между Покупателем и Продавцом применяются
            положения ГК РК (в т.ч. положение о розничной купле-продаже, Закон
            Республики Казахстан от 4 мая 2010 года № 274-IV «О защите прав
            потребителей» (с изменениями по состоянию на 13.01.2014 г.) и иные
            нормативно-правовые акты действующего законодательства Республики
            Казахстан (далее по тексту настоящей оферты – «РК»).
          </p>
          <p>
            1.5. Продавец оставляет за собой право вносить изменения в настоящую
            оферту, в связи с чем Покупатель обязуется самостоятельно
            контролировать наличие изменений в настоящей оферте, размещенной на
            Сайте. Уведомление об изменении настоящей оферты Продавец обязан
            разместить на Сайте в виде информационного сообщения не позднее, чем
            за 3 (Три) рабочих дня до даты их вступления в силу.
          </p>

          <h3>2. Предмет Договора</h3>
          <p>
            2.1. Продавец передает, продает Товары по ценам, представленным на
            Сайте Продавца, а Покупатель производит оплату и принимает Товары в
            соответствии с условиями настоящей оферты.
          </p>
          <p>
            2.2. Право собственности на Товары переходит к Покупателю в момент
            приемки Товаров Покупателем и оплаты последним полной стоимости
            принятых Товаров. Риск случайной гибели или повреждения Товаров
            переходит к Покупателю с момента приемки Товаров Покупателем.
          </p>

          <h3>3. Права и обязанности сторон</h3>
          <h3>3.1. Продавец обязуется:</h3>
          <p>
            3.1.1. с момента принятия настоящей оферты обеспечить исполнение
            своих обязательств перед Покупателем на условиях, установленных
            настоящей офертой и в соответствии с требованиями действующего
            законодательства РК. Продавец оставляет за собой право отказаться от
            исполнения своих обязательств в случае возникновения обстоятельств
            непреодолимой силы («форс-мажор») в соответствии с Разделом 9
            настоящей оферты;
          </p>
          <p>
            3.1.2. обрабатывать и хранить персональные данные Покупателя,
            предоставленные Продавцу, обеспечивать их конфиденциальность и не
            предоставлять доступ к этой информации третьим лицам, за исключением
            случаев, предусмотренных действующим законодательством РК. Принимая
            (акцептируя) настоящую оферту, Покупатель подтверждает свое согласие
            и разрешает Оператору обрабатывать свои персональные данные, в том
            числе: фамилию, имя, отчество; дату рождения, адрес доставки;
            телефон. Под обработкой персональных данных в настоящей оферте
            понимается: сбор вышеуказанных данных, их систематизация,
            накопление, хранение, уточнение (обновление, изменение),
            использование, блокирование, уничтожение.
          </p>
          <p>
            3.1.2.1. Оператор имеет право на передачу персональных данных
            Покупателя Курьерской службе с целью доставки Покупателю заказанных
            последним Товаров.
          </p>
          <p>
            3.1.2.2. Покупатель выражает согласие и разрешает Оператору и его
            службам обрабатывать персональные данные Покупателя с помощью
            автоматизированных систем управления базами данных, а также иных
            программных и технических средств. Работа с такими системами
            осуществляется по вышеуказанному в пункте 3.1.2. алгоритму (сбор,
            систематизация, накопление, хранение, уточнение, использование,
            блокирование, уничтожение).
          </p>

          <p>
            3.1.2.3. Оператор вправе самостоятельно определять используемые
            способы обработки персональных данных Покупателя (включая, но, не
            ограничиваясь: автоматическая сверка почтовых кодов с базой
            кодов/индексов, автоматическая проверка написания названий
            улиц/населенных пунктов, сегментация базы данных по заданным
            критериям и т.д.).
          </p>

          <p>
            3.1.2.4. Оператор обеспечивает конфиденциальность предоставленных
            Покупателем персональных данных, их защиту от копирования,
            распространения. В любой момент Покупатель вправе запросить перечень
            своих персональных данных и/или потребовать изменить, уничтожить
            свои персональные данные, позвонив Оператору по телефону, указав
            имя, отчество, фамилию и адрес доставки.
          </p>

          <p>
            3.1.2.5. В соответствии с Законом Республики Казахстан Об
            информатизации Продавец обязуется предотвращать попытки
            несанкционированного доступа к персональным данным Покупателя,
            предоставленных Продавцу; своевременно обнаруживать и пресекать
            такие попытки.
          </p>

          <p>
            3.2. Продавец имеет право изменять условия настоящей оферты; цены на
            Товары, указанные в Интернет-магазине; условия оплаты и доставки
            Товаров; способы, сроки и территорию доставки Товаров; а также иные
            условия, указанные в настоящей оферте и на Сайте.
          </p>

          <h3>3.1. Покупатель обязуется:</h3>

          <p>
            3.3.1. до момента оформления Заказа на Сайте - ознакомиться с
            содержанием и условиями, установленными в настоящей оферте, а также
            с иными условиями, указанными на Сайте, в том числе с ценами на
            Товары, установленными в Интернет-магазине, зоной доставки Товаров и
            минимальной стоимостью Заказа, который необходимо сделать, чтобы он
            был доставлен Покупателю;
          </p>
          <p>
            3.3.2. предоставить достоверные персональные данные, необходимые для
            идентификации Покупателя и достаточные для совершения сделки с
            Продавцом и доставки Покупателю заказанных им Товаров;
          </p>
          <p>3.3.3. оплатить заказанные Товары на условиях настоящей оферты;</p>
          <p>
            3.3.4. не использовать Товары, заказанные в Интернет-магазине, в
            предпринимательских целях;
          </p>
          <p>
            3.3.5. соблюдать условия, установленные в настоящей оферте, а также
            иные условия, указанные на Сайте.
          </p>
          <p>3.4. Покупатель имеет право;</p>
          <p>
            3.4.1. использовать Интернет-магазин после регистрации учетной
            записи Пользователя. Данные учетной записи являются исключительными
            и непередаваемыми.
          </p>
          <p>
            В случае передачи Покупателем данных учетной записи третьему лицу,
            Покупатель в полном объеме несет ответственность за действия,
            совершенные такими третьими лицами, а также за убытки, причиненные
            такими третьими лицами Продавцу;
          </p>
          <p>
            3.4.3. на получение информации (рекламных сообщений, рассылку) о
            проводимых акциях в виде сообщений на электронную почту на указанный
            адрес почты или sms-сообщений по сетям подвижной радиотелефонной
            связи на указанный при регистрации абонентский номер телефона.
            Пользователь имеет возможность в любой момент отписаться от
            рассылки, а также подписаться на рассылку вновь.
          </p>

          <h3>4. Регистрация в Интернет-магазине</h3>
          <p>
            4.1. Для получения права использования Интернет-магазина Покупатель
            обязуется осуществить регистрацию учетной записи Пользователя на
            Сайте.
          </p>
          <p>
            4.2. Регистрация Пользователя осуществляется следующим образом:
            <br />
            а) ввести в форму абонентский номер телефона в формате
            (+7ХХХХХХХХХХ); указанный Пользователем при регистрации абонентский
            номер телефона будет использоваться в качестве имени Пользователя
            (логин) при использовании Интернет-магазина;
            <br />
            б) ввести код подтверждения, предоставляемый Покупателю Оператором,
            путем получения его в виде SMS-сообщения на указанный абонентский
            номер;
            <br />
            в) принять настоящую оферту, согласившись с ее условиями;
            <br />
            г) при желании дать свое согласие на получение информации (рекламы)
            о проводимых акциях Продавца.
          </p>

          <p>
            4.3. Регистрация будет считаться завершенной после корректного ввода
            Пользователем пароля, полученного им от Оператора в SMS–сообщении.
          </p>

          <p>
            4.4. Совершая действия по регистрации учетной записи Пользователя в
            Интернет-магазине, Пользователь принимает условия настоящей оферты,
            в полном объеме и без каких-либо изъятий.
          </p>

          <p>
            4.5. Регистрация Покупателя позволяет избежать несанкционированных
            действий третьих лиц от имени Покупателя и открывает последнему
            доступ к дополнительным сервисам Интернет-магазина. Передача
            Покупателем логина и пароля третьим лицам не допускается.
          </p>

          <p>
            4.6. Продавец не несет ответственности за точность и правильность
            информации, предоставленной Покупателем при регистрации.
          </p>

          <h3>5. Оформление и сроки выполнения Заказа</h3>
          <p>
            5.1. Заказ Покупателя может быть оформлен по телефону и/или
            посредством заполнения электронной формы Заказа на Сайте.
          </p>

          <p>
            5.1.1. При оформлении Заказа по телефону или посредством электронной
            формы на Сайте, Покупатель тем самым подтверждает, что он ознакомлен
            с условиями настоящей оферты и обязуется предоставить Продавцу всю
            информацию, необходимую для надлежащего оформления и исполнения
            Заказа.
          </p>

          <p>
            5.1.2. При оформлении Заказа через Сайт Покупатель заполняет
            электронную форму Заказа и отправляет сформированный Заказ Продавцу
            путем подтверждения Заказа в электронной форме.
          </p>

          <p>
            5.2. Если в магазине Продавца отсутствует необходимое количество или
            ассортимент заказанных Покупателем Товаров, Продавец информирует об
            этом Покупателя по телефону в течение 10 минут после получения
            Заказа от Покупателя. Покупатель вправе согласиться принять Товары в
            ином количестве или ассортименте, либо аннулировать свой Заказ. В
            случае неполучения ответа Покупателя Продавец вправе аннулировать
            Заказ Покупателя в полном объеме.
          </p>

          <p>
            5.3. Покупатель имеет право отказаться от Заказа в течении 3 минут
            после оформления заказа.
          </p>

          <p>
            5.4. В случае возникновения у Покупателя дополнительных вопросов,
            касающихся свойств и характеристик Товаров, перед оформлением
            Заказа, Покупатель должен обратиться к Продавцу по телефону для
            получения необходимой информации, в соответствии с режимом работы,
            указанным на Сайте.
          </p>

          <h3>6. Доставка Товаров</h3>
          <p>
            6.1. Продавец приложит все усилия для соблюдения сроков доставки
            Товаров, установленных в настоящей оферте и/или на Сайте. Однако
            задержки в доставке Товаров возможны ввиду непредвиденных
            обстоятельств.
          </p>

          <p>
            6.2. В случае если Товары не были переданы Покупателю по вине
            последнего, отказа Покупателя от приемки и/или оплаты заказанного им
            Товара, ложного вызова, Продавец вправе заблокировать логин
            (абонентский номер телефона) Покупателя.
          </p>

          <p>
            6.3. Доставка Товаров осуществляется Курьерской службой по
            фактическому адресу, указанному Покупателем при оформлении Заказа на
            Интернет-сайте.
          </p>

          <p>
            6.3.1. Доставка Товаров по г. в пределах зоны доставки (зона
            доставки указана на Сайте или может быть уточнена по телефону)
            осуществляется в соответствии с режимом работы, указанным на Сайте.
          </p>

          <p>
            6.3.2. Доставка Товаров по адресам, не входящим в зону доставки не
            осуществляется.
          </p>

          <p>
            6.4. Доставка осуществляется при условии, что Покупатель сделает
            Заказ на сумму минимального заказа, сумма минимального заказа
            определяется Продавцом в одностороннем порядке и указывается на
            Сайте Продавца.
          </p>

          <h3>7. Оплата Товаров</h3>
          <p>
            7.1. Цены на Товары определяются Продавцом в одностороннем порядке и
            указываются на Сайте в казахстанских тенге. Цена Товаров может быть
            изменена Продавцом в одностороннем порядке. При этом цена на
            заказанный Покупателем Товар изменению не подлежит.
          </p>

          <p>
            7.2. Оплата Товаров Покупателем производится в тенге, наличными
            денежными средствами или безналичным расчетом по карте Visa/Master
            Card.
          </p>

          <p>
            7.3. Оплата осуществляется по факту получения Товаров,
            подтверждением которой является предоставленный работником
            Курьерской службы кассовый или товарный чек.
          </p>

          <h3>8. Возврат и обмен Товаров</h3>
          <p>
            8.1. Продавец обязан передать Покупателю Товары, которые полностью
            соответствуют его Заказу, качество которых соответствует информации,
            представленной Покупателю при заключении Договора, а также
            информации, доведенной до его сведения при передаче Товаров (на
            этикетке или вкладыше, прикрепленных к Товарам или их упаковке, либо
            другими способами, предусмотренными для отдельных видов Товаров).
          </p>

          <p>
            8.2. При получении Товаров Покупатель проверяет соответствие
            полученных Товаров Заказу, комплектность и отсутствие претензий к
            внешнему виду доставленного Товаров. В случае получения
            некачественных, некомплектных Товаров, либо несоответствия
            полученных Товаров заказанному, Покупатель вправе потребовать замены
            таких Товаров Товарами надлежащего качества сразу в момент
            получения, либо в течение 1 часа после получения Товаров.
          </p>

          <p>
            8.3. В случае невыполнения условий п. 8.2 настоящей оферты,
            претензии Покупателя по внешнему виду Товаров и их комплектности не
            принимаются.
          </p>

          <h3>9. Форс-мажор</h3>
          <p>
            9.1 Любая из Сторон освобождается от ответственности за полное или
            частичное неисполнение своих обязательств по настоящей оферте, если
            это неисполнение было вызвано обстоятельствами непреодолимой силы.
            Обстоятельства непреодолимой силы означают чрезвычайные события и
            обстоятельства, которые Стороны не могли ни предвидеть, ни
            предотвратить разумными средствами. Такие чрезвычайные события или
            обстоятельства включают в себя, в частности: забастовки, наводнения,
            пожары, землетрясения и иные стихийные бедствия, войны, военные
            действия и т.д.
          </p>

          <h3>10. Ответственность сторон</h3>
          <p>
            10.1. За неисполнение или ненадлежащее исполнение условий настоящей
            оферты (акцептованной Покупателем оферты Продавца) Стороны несут
            ответственность в соответствии с законодательством РК.
          </p>

          <p>
            10.2. Вся текстовая информация и графические изображения,
            размещенные в Интернет-магазине и на Сайте имеют законного
            правообладателя. Незаконное использование указанной информации и
            изображений преследуется в соответствии с действующим
            законодательством РК. В случае размещения информации и/или
            изображения, взятого с ресурса furshetfood.kz_, размещение ссылки на
            ресурс furshetfood.kz обязательно.
          </p>

          <p>
            10.3. Продавец не несет ответственности за ущерб, причиненный
            Покупателю вследствие ненадлежащего использования им Товаров,
            приобретённых в Интернет-магазине.
          </p>

          <p>
            10.4. Продавец не отвечает за убытки Покупателя, возникшие в
            результате неправильного заполнения Заказа, в том числе
            неправильного указания персональных данных;
          </p>

          <p>
            10.5. Покупатель несет полную ответственность за достоверность
            сведений и персональных данных, указанных им при регистрации в
            Интернет-магазине.
          </p>

          <p>
            10.6. Пользователь гарантирует, что не будет использовать
            Интернет-магазин и Сайт в иных целях, нежели указанных в настоящей
            оферте.
          </p>

          <p>
            10.7. В случае нарушения Пользователем обязательств по условиям
            настоящей оферты Продавец вправе заблокировать доступ Покупателя к
            использованию Интернет-магазина, путем блокировки логина
            (абонентского номера телефона) Покупателя.
          </p>

          <h3>11. Прочие условия</h3>
          <p>
            11.1. Настоящая оферта вступает в силу с момента совершения
            Покупателем действий, направленных на регистрацию учетной записи
            (логина) в Интернет-магазине.
          </p>

          <p>
            11.2. Все споры, связанные с неисполнением или ненадлежащим
            исполнением своих обязательств по настоящему Договору, Стороны будут
            стараться решить путем переговоров.
          </p>

          <p>
            11.3. В случае не достижения согласия в ходе переговоров, споры
            будут разрешаться в судебном порядке в соответствии с действующим
            законодательством РК.
          </p>

          <h3>12. Адрес и реквизиты Компании</h3>
          <p>ИП "ДЖАПАРОВА М.М_"</p>
          <p>БИН/ИИН 820708450240</p>
          <p>Адрес: К. АЗЕРБАЕВА 2</p>
          <p>БИК: CASPKZKA</p>
          <p>Банк: АО KASPI BANK</p>
          <p>ИИК: KZ70722S000014471370</p>
        </section>
      </div>
      <Footer />
    </>
  );
};

const styles = {
  container: {
    maxWidth: "1200px",
    margin: "0 auto",
    padding: "40px 20px",
    lineHeight: 1.6,
    fontSize: "16px",
    color: "#222",
  },
  title: {
    fontSize: "28px",
    marginBottom: "25px",
    fontWeight: 700,
  },
  section: {
    marginBottom: "32px",
  },
};

export default PublicOffer;
